[{"category":"business","title":"India's retail inflation surges to 7.79% in April, highest in 8 years","content":"India's retail inflation surged to 7.79% in April 2022, the highest since May 2014, data released by the government on Thursday showed. At 7.79%, the Consumer Price Index (CPI) inflation for April is higher than the March number of 6.95%. Earlier this month, RBI Governor Shaktikanta Das had said inflation was \"expected to be elevated\" in April.\n\nshort by Pragya Swastik \/ \n      06:11 pm on 12 May","author":"Pragya Swastik","published":"2022-05-12T12:41:14.000Z"},{"category":"business","title":"Rupee hits new all-time low, slips to 77.55 against US dollar","content":"The Indian rupee has touched a fresh all-time low of 77.55 against the US dollar. The rupee slumped 30 paise in opening trade as a lacklustre trend in the domestic equity markets and a firm American currency weighed on investor sentiment, reports said. Besides, persistent foreign fund outflows and elevated crude oil prices impacted the domestic unit, forex traders said.\n\nshort by Apaar Sharma \/ \n      11:28 am on 12 May","author":"Apaar Sharma","published":"2022-05-12T05:58:52.000Z"},{"category":"business","title":"List of 10 highest-paid sportspersons released by Forbes","content":"Argentina and PSG forward Lionel Messi was the highest-paid sportsperson over the past year with earnings of $130 million, as per Forbes' list of 10 highest-paid sportspersons. It is the second time that Messi has topped the list. He is followed by LeBron James ($121.2 million) and Cristiano Ronaldo ($115 million)\n\nshort by Anmol Sharma \/ \n      10:52 am on 12 May","author":"Anmol Sharma","published":"2022-05-12T05:22:54.000Z"},{"category":"business","title":"Saudi Aramco dethrones Apple as world's most valuable company","content":"World's biggest crude exporter Saudi Aramco has overtaken Apple as the world's most valuable company. The Saudi state-run oil company's market cap rose to $2.43 trillion on Wednesday after its shares surged due to higher oil prices. Meanwhile, Apple's market capitalisation fell to $2.37 trillion after its share price tanked 5.2% on Wednesday.\n\nshort by Anmol Sharma \/ \n      11:10 am on 12 May","author":"Anmol Sharma","published":"2022-05-12T05:40:33.000Z"},{"category":"business","title":"Over $200 billion wiped off cryptocurrency market in 24 hours","content":"More than $200 billion of wealth was wiped out from the cryptocurrency market in just 24 hours amid a massive sell-off, Bloomberg reported on Thursday citing CoinMarketCap data. The crypto plunge was driven by the collapse of the TerraUSD stablecoin. The plunge affected major tokens and Bitcoin plunged by as much as 10% to its lowest level since December 2020.\n\nshort by Pragya Swastik \/ \n      05:49 pm on 12 May","author":"Pragya Swastik","published":"2022-05-12T12:19:46.000Z"},{"category":"business","title":"Sensex crashes 1,158 points to close at 52,930 in the 5th-straight session of fall","content":"Sensex fell for the fifth-straight day on Thursday, crashing 1,158 points to close at 52,930, while Nifty closed 359 points lower at 15,808. The market indices dropped over 2%, dragged by banking, financial and metal stocks amid worries over April inflation data and a decline in global stocks. Adani Ports, IndusInd Bank and Tata Steel were among the top losers.\n\nshort by Pragya Swastik \/ \n      03:55 pm on 12 May","author":"Pragya Swastik","published":"2022-05-12T10:25:44.000Z"},{"category":"business","title":"Investors lose nearly ₹19 lakh crore in five trading sessions","content":"The wealth of equity investors tumbled by over ₹18.74 lakh crore as the market indices continued to fall for the fifth session on Thursday. While the Sensex plunged 1,158 points to end at 52,930 on Thursday, the Nifty plunged 359 points to settle at 15,808. Markets continued to remain under pressure in sync with the global markets slump, experts said.\n\nshort by Pragya Swastik \/ \n      07:47 pm on 12 May","author":"Pragya Swastik","published":"2022-05-12T14:17:07.000Z"},{"category":"business","title":"SRK-led Knight Riders Group acquires Abu Dhabi franchise in UAE's T20 League","content":"Shah Rukh Khan-led Knight Riders Group has acquired the Abu Dhabi franchise in UAE's T20 League.  \"We're excited about becoming part of UAE’s T20 League, which no doubt will become hugely successful,\" Shah Rukh said. As many as six teams will compete in UAE's T20 League. Reliance Industries Limited also owns a team in the league.\n\nshort by Anmol Sharma \/ \n      06:54 pm on 12 May","author":"Anmol Sharma","published":"2022-05-12T13:24:53.000Z"},{"category":"business","title":"Siemens announces exit from Russian market, condemns Ukrainian war","content":"German multinational conglomerate Siemens will quit the Russian market due to the war in Ukraine. \"We join the international community in condemning the war in Ukraine and are focused on supporting our people and providing humanitarian aid,\" CEO Roland Busch said. Siemens reportedly employs around 3,000 people in Russia and had earlier decided not to take on new projects there.\n\nshort by Aishwarya Awasthi \/ \n      11:22 am on 12 May","author":"Aishwarya Awasthi","published":"2022-05-12T05:52:27.000Z"},{"category":"business","title":"Child sandwiched between parents on scooter motivated me to build Nano: Tata","content":"Tata Sons Chairman Emeritus Ratan Tata took to Instagram to share a picture of him with Tata Nano, the compact car that he launched in 2008. \"What really motivated me...was constantly seeing Indian families on scooters, maybe the child sandwiched between the mother and father,\" Tata wrote on building Nano. \"Nano was always meant for all our people,\" he added.\n\nshort by Pragya Swastik \/ \n      04:47 pm on 12 May","author":"Pragya Swastik","published":"2022-05-12T11:17:59.000Z"},{"category":"business","title":"Campbell Wilson appointed CEO and MD of Air India","content":"Tata Sons has appointed Campbell Wilson as the new CEO and MD of Air India. \"It's an honour to be selected to lead the iconic Air India. It's at the cusp of an exciting journey to become one of the best airlines,\" Wilson said. The 50-year-old New Zealand-born executive recently resigned as CEO of Singapore Airlines budget carrier Scoot.\n\nshort by Anmol Sharma \/ \n      03:48 pm on 12 May","author":"Anmol Sharma","published":"2022-05-12T10:18:30.000Z"},{"category":"business","title":"Musk's delay in disclosing Twitter stake under probe by US SEC: WSJ","content":"The US SEC is investigating Tesla CEO Elon Musk's delay in disclosing his Twitter stake last month, the WSJ reported. Musk had revealed his 9.2% stake in Twitter to SEC on April 4, a delay of at least 10 days since surpassing the 5% threshold for revealing a shareholding. Musk has lately been embroiled in a dispute with the SEC.\n\nshort by Aishwarya Awasthi \/ \n      09:11 am on 12 May","author":"Aishwarya Awasthi","published":"2022-05-12T03:41:36.000Z"},{"category":"business","title":"Global crypto regulation body likely in next year: IOSCO Chair","content":"The International Organisation of Securities Commissions' (IOSCO) Chair Ashley Alder said global market regulators are likely to launch a joint body within the next year to better co-ordinate cryptocurrency rules. \"There's a wall of worry about this (crypto)...at an institutional level,\" Alder stated. He added that the main concerns are cyber security and a lack of transparency, among others.\n\nshort by Ananya Goyal \/ \n      08:10 pm on 12 May","author":"Ananya Goyal","published":"2022-05-12T14:40:54.000Z"},{"category":"business","title":"HC allows Xiaomi conditional access to seized ₹5,551 cr: Report","content":"The Karnataka High Court has declined to reinstate a freeze on ₹5,551 crore belonging to Chinese smartphone-maker Xiaomi, Hindustan Times reported citing Reuters. The funds were seized by the Enforcement Directorate in connection with \"illegal outward remittances\" but the seizure was stayed after Xiaomi appealed. The Court also allowed Xiaomi to use a bank overdraft facility to make payments.\n\nshort by Ashley Paul \/ \n      03:49 pm on 12 May","author":"Ashley Paul","published":"2022-05-12T10:19:05.000Z"},{"category":"business","title":"Toyota to make EV parts in India for domestic, export markets","content":"Toyota Kirloskar Motor's Senior VP Vikram Gulati said the firm plans to make EV parts in India to meet domestic demand as well as for export to Japan and some ASEAN countries. It plans to start with making e-drives or electric powertrain parts used by different EV types. Gulati added Toyota aspires to make India manufacturing hub for cleaner technologies.\n\n\nshort by Aishwarya Awasthi \/ \n      08:57 am on 12 May","author":"Aishwarya Awasthi","published":"2022-05-12T03:27:45.000Z"},{"category":"business","title":"SoftBank's Vision Fund reports record $26 billion loss","content":"Japan's SoftBank Group reported a record $26.2 billion loss at its Vision Fund investment arm on Thursday. The group also reported a net loss of $13.2 billion for the financial year that ended March 31. This is reportedly its biggest full-year loss which followed a nearly $38.8 billion net profit in the previous fiscal year.\n\nshort by Aishwarya Awasthi \/ \n      03:28 pm on 12 May","author":"Aishwarya Awasthi","published":"2022-05-12T09:58:26.000Z"},{"category":"business","title":"Ford drops plans to make EVs for exports in India","content":"Ford Motor has dropped plans to make electric vehicles (EVs) in India for exports. \"After careful review, we have decided to no longer pursue EV manufacturing for exports from any of the Indian plants,\" a spokesperson said. In September 2021, Ford had announced it would cease local manufacturing in India, citing an operating loss of $2 billion over 10 years.\n\nshort by Aishwarya Awasthi \/ \n      04:17 pm on 12 May","author":"Aishwarya Awasthi","published":"2022-05-12T10:47:35.000Z"},{"category":"business","title":"Step up exports to $100 bn for $1 tn economy by 2030: Tamil Nadu CM","content":"Tamil Nadu's export share stands at $26 billion and this should be increased to $100 billion by 2030, Tamil Nadu CM MK Stalin said. He added that this would help meet the Centre's target of achieving $1 trillion economy by 2030. The southern zone's share in India's exports will increase from 27% to 35% in five years, he further said.\n\nshort by Ananya Goyal \/ \n      11:14 pm on 11 May","author":"Ananya Goyal","published":"2022-05-11T17:44:34.000Z"},{"category":"business","title":"India's industrial output rises from 1.5% in Feb to 1.9% in Mar","content":"India's industrial output, measured in terms of the Index of Industrial Production (IIP), witnessed a growth of 1.9% in March, up from 1.5% in February. This comes after data released on April 29 showed output of India's eight core sectors grew 4.3% YoY in March 2022, down from 6% in February 2022. The eight sectors account for 40.3% of IIP.\n\nshort by Ashley Paul \/ \n      07:06 pm on 12 May","author":"Ashley Paul","published":"2022-05-12T13:36:34.000Z"},{"category":"business","title":"Ramkrishna, Subramanian's bail pleas in NSE scam case rejected","content":"A Delhi court on Thursday dismissed the bail pleas filed by NSE's ex-CEO Chitra Ramkrishna and ex-Group Operating Officer Anand Subramanian in connection with the co-location scam case. The CBI told the court that the accused, holding influential positions, could tamper with the evidence and must be kept in custody. Ramkrishna has been accused of frequently revising Subramanian's designation.\n\nshort by Ananya Goyal \/ \n      04:53 pm on 12 May","author":"Ananya Goyal","published":"2022-05-12T11:23:51.000Z"},{"category":"business","title":"Ashni Biyani resigns as Future Consumer MD due to 'personal constraints'","content":"Ashni Biyani, daughter of Future Group CEO Kishore Biyani, has resigned as the MD of Future Consumer Limited citing \"personal constraints and challenges\", the company said in a stock exchange filing on Thursday. \"She has also ceased to be a 'key managerial personnel' of the company,\" the company further said. She will continue to serve as Future Consumer's Non-Executive Director.\n\nshort by Ashley Paul \/ \n      08:41 pm on 12 May","author":"Ashley Paul","published":"2022-05-12T15:11:16.000Z"},{"category":"business","title":"SC refuses interim relief to those seeking stay on LIC IPO allotment","content":"The Supreme Court on Thursday refused to grant interim relief to petitioners who challenged amendments to the LIC Act by Finance Act of 2021 and demanded a stay on the insurer's IPO allotment process. \"We're not inclined to grant any interim relief,\" SC said. It also sought the Centre and LIC's replies on the batch of pleas within eight weeks.\n\nshort by Ashley Paul \/ \n      02:51 pm on 12 May","author":"Ashley Paul","published":"2022-05-12T09:21:18.000Z"},{"category":"business","title":"Morgan Stanley cuts India's GDP growth forecasts by 30 bps","content":"Morgan Stanley has lowered its forecasts for India's GDP growth to 7.6% for FY23 and 6.7% for FY24, 30 basis points lower than the previous estimates. Both inflation and the country's current account deficit will likely get worse, it said. The report cited a global slowdown, surging oil prices and weak domestic demand as some of the reasons.\n\nshort by Ananya Goyal \/ \n      09:05 pm on 11 May","author":"Ananya Goyal","published":"2022-05-11T15:35:47.000Z"},{"category":"business","title":"Sanctions on Russia won't affect global oil supply: IEA","content":"The International Energy Agency (IEA) said the world won't be left short of oil even with lower output from sanctions-hit Russia. \"Steadily rising volumes from...OPEC+ and the US along with a slowdown in demand growth is expected to fend off an acute supply deficit,\" the IEA said. This comes after it predicted a possible global oil \"supply shock\" in March.\n\nshort by Ananya Goyal \/ \n      08:15 pm on 12 May","author":"Ananya Goyal","published":"2022-05-12T14:45:45.000Z"},{"category":"business","title":"Govt eases environmental rules for coal mines to tackle fuel crisis","content":"The Centre has eased environmental approvals for expansion of coal mines to boost output amid the ongoing fuel crisis across the country. A government note said the move will enable raising coal production by a further 10% without requiring new impact assessments. Rules on consulting local residents about the expansions have also been loosened, the note added.\n\nshort by Ananya Goyal \/ \n      10:40 pm on 11 May","author":"Ananya Goyal","published":"2022-05-11T17:10:21.000Z"},{"category":"sports","title":"List of 10 highest-paid sportspersons released by Forbes","content":"Argentina and PSG forward Lionel Messi was the highest-paid sportsperson over the past year with earnings of $130 million, as per Forbes' list of 10 highest-paid sportspersons. It is the second time that Messi has topped the list. He is followed by LeBron James ($121.2 million) and Cristiano Ronaldo ($115 million)\n\nshort by Anmol Sharma \/ \n      10:52 am on 12 May","author":"Anmol Sharma","published":"2022-05-12T05:22:54.000Z"},{"category":"sports","title":"CSK's Conway gets out on golden duck as DRS not available due to power issues","content":"CSK opener Devon Conway was dismissed for a golden duck after the on-field umpire adjudged him LBW out off MI's Daniel Sams. Conway couldn't take a review as the facility wasn't available due to power issues in the stadium. After watching the replay, commentator Simon Doull was heard saying, \"Oh dear me. It's missing leg [stump] by a long way.\"\n\nshort by Anmol Sharma \/ \n      08:07 pm on 12 May","author":"Anmol Sharma","published":"2022-05-12T14:37:35.000Z"},{"category":"sports","title":"Anushka Sharma praises Virat Kohli for laughing at jokes about his bad form in interview","content":"Actress Anushka Sharma took to her Instagram Stories to praise her husband, RCB batter Virat Kohli, for laughing at jokes about his bad form in a recent interview. Anushka wrote, \"If you cannot laugh at yourself, you may be missing the colossal joke of the century.\" Kohli was seen laughing when the interviewer asked him about his \"pet ducks\".\n\nshort by Anmol Sharma \/ \n      09:44 am on 12 May","author":"Anmol Sharma","published":"2022-05-12T04:14:07.000Z"},{"category":"sports","title":"CSK unfollow Ravindra Jadeja on Instagram, CEO denies rumours of rift","content":"CSK unfollowed Ravindra Jadeja on Instagram, sparking rumours of a rift. Following this, CSK CEO Kasi Viswanathan told The Indian Express, \"I've no knowledge of what's going on there.\" Rubbishing rift rumours, he added, \"What I can tell you is that from the management side, there has been no problem and whatever is there on social media, I'm not aware.\"\n\nshort by Anmol Sharma \/ \n      12:50 pm on 12 May","author":"Anmol Sharma","published":"2022-05-12T07:20:52.000Z"},{"category":"sports","title":"My father's entire battalion installed projector to watch my debut: MI spinner Kartikeya","content":"MI's Kumar Kartikeya, who describes himself as a mystery spinner, revealed in a video for MI that his policeman father's entire battalion installed a projector to watch his IPL debut in Jhansi. Kartikeya added, \"When I took my first wicket, everyone clapped for [my father] and hugged him. When he shared that video, that was an unparalleled feeling for me.\"\n\nshort by Anmol Sharma \/ \n      02:53 pm on 12 May","author":"Anmol Sharma","published":"2022-05-12T09:23:33.000Z"},{"category":"sports","title":"Can't attend my only brother's marriage due to tournaments: Record holder hurdler Jyothi","content":"Jyothi Yarraji, who on Tuesday became the fastest Indian woman to run 100-metre hurdles, said that she won't be able to attend her only brother's marriage later this month due to tournaments. \"I have hardly attended any family functions. I haven’t been home on festivals and I miss going out like my friends,\" the 22-year-old added.\n\nshort by Anmol Sharma \/ \n      03:53 pm on 12 May","author":"Anmol Sharma","published":"2022-05-12T10:23:42.000Z"},{"category":"sports","title":"SRK-led Knight Riders Group acquires Abu Dhabi franchise in UAE's T20 League","content":"Shah Rukh Khan-led Knight Riders Group has acquired the Abu Dhabi franchise in UAE's T20 League.  \"We're excited about becoming part of UAE’s T20 League, which no doubt will become hugely successful,\" Shah Rukh said. As many as six teams will compete in UAE's T20 League. Reliance Industries Limited also owns a team in the league.\n\nshort by Anmol Sharma \/ \n      06:54 pm on 12 May","author":"Anmol Sharma","published":"2022-05-12T13:24:53.000Z"},{"category":"sports","title":"What we talked was personal, not even my brothers know about it: Rizwan on chat with Kohli","content":"On being asked about his interaction with Virat Kohli after Pakistan's win against India in T20 World Cup 2021, Pakistan wicketkeeper-batter Muhammad Rizwan said, \"What we talked was personal.\" He added, \"At my home, not even my brothers know about it.\" Rizwan further said that he would pray for Kohli as the ex-India captain is going through a tough phase.\n\nshort by Anmol Sharma \/ \n      01:53 pm on 12 May","author":"Anmol Sharma","published":"2022-05-12T08:23:58.000Z"},{"category":"sports","title":"MI to bowl first against CSK in bottom-of-the-table clash, Kieron Pollard dropped","content":"MI captain Rohit Sharma won the toss and elected to bowl first against CSK in the bottom-of-the-table clash in IPL 2022. Bottom-placed MI have dropped Kieron Pollard from their playing XI and have replaced him with Tristan Stubbs. They have also included Hrithik Shokeen in place of Murugan Ashwin. Meanwhile, ninth-placed CSK are fielding the same playing XI.\n\nshort by Anmol Sharma \/ \n      07:25 pm on 12 May","author":"Anmol Sharma","published":"2022-05-12T13:55:23.000Z"},{"category":"sports","title":"Chhattisgarh Ranji captain Harpreet booked in govt job cheating case","content":"Chhattisgarh's Ranji Trophy team captain Harpreet Singh Bhatia has been booked for cheating and forgery after allegedly getting a government job in the office of Principal Accountant General (Audit) Chhattisgarh by submitting bogus documents. Harpreet had submitted a BCom degree certificate from Bundelkhand University, however, officials found that no such marksheet had been issued. \n\nshort by Anmol Sharma \/ \n      04:50 pm on 12 May","author":"Anmol Sharma","published":"2022-05-12T11:20:58.000Z"},{"category":"sports","title":"Ponting backed Rishabh Pant ahead of Shreyas Iyer: Ajay Jadeja","content":"Talking about DC's performance in the ongoing IPL season, ex-India cricketer Ajay Jadeja said Rishabh Pant has been good with the captaincy. \"At times, when someone is made captain, you can feel that someone's guiding them. But with Pant, it's clear that he is the one calling the shots. Ricky Ponting backed Pant ahead of ex-captain Shreyas Iyer,\" he added. \n\nshort by Ankur Taliyan \/ \n      02:26 pm on 12 May","author":"Ankur Taliyan","published":"2022-05-12T08:56:08.000Z"},{"category":"sports","title":"Umran capable of playing int'l cricket, his 90% deliveries are 145 kmph: Steyn","content":"Former South Africa pacer Dale Steyn has termed SRH pacer Umran Malik an \"all-out fast bowler\", who is capable of playing international cricket. Steyn added, \"How India uses Umran is up to them...[but] one guy bowling 150 kmph consistently, I think every international team will want him. How and where you use him is critical,\" Steyn.\n\nshort by Ankur Taliyan \/ \n      01:39 pm on 12 May","author":"Ankur Taliyan","published":"2022-05-12T08:09:01.000Z"},{"category":"sports","title":"Replacing Chahal is no mean feat: RCB spin bowling coach Sriram on Hasaranga","content":"RCB spin bowling coach Sridharan Sriram said spinner Wanindu Hasaranga has handled the pressure and expectations brilliantly in the ongoing IPL season after being bought for ₹10.75 crore at the mega auction. \"Replacing Yuzvendra Chahal at RCB is no mean feat...and to come and fill in his boots and be second on the [wicket-takers'] list is brilliant,\" he added. \n\nshort by Ankur Taliyan \/ \n      03:27 pm on 12 May","author":"Ankur Taliyan","published":"2022-05-12T09:57:08.000Z"},{"category":"sports","title":"Once Marsh gets going, he's one of the best T20 batters in the world: Watson","content":"DC assistant coach Shane Watson said Mitchell Marsh is \"one of the best T20 batters in the world\" when he gets going. \"It took Marsh a few games to get going...after the COVID-19 setback...[but] he adds a lot of value,\" added Watson. Marsh scored 89(62) to help DC chase down RR's 160-run total. Currently, DC are fifth on IPL standings.\n\nshort by Ankur Taliyan \/ \n      04:48 pm on 12 May","author":"Ankur Taliyan","published":"2022-05-12T11:18:36.000Z"},{"category":"sports","title":"Pant should not even try doing what MS Dhoni does now: Ajay Jadeja","content":"Ex-India batter Ajay Jadeja said DC captain Rishabh Pant \"should not\" even try doing what MS Dhoni does currently, adding that Pant should do what Dhoni used to do at his age. \"Pant is a young player but [it] feels like he's been made a senior statesman very early,\" stated Ajay. Dhoni's current strike rate in IPL 2022 is 139.31.\n\nshort by Arnab Mukherji  \/ \n      03:22 pm on 12 May","author":"Arnab Mukherji ","published":"2022-05-12T09:52:29.000Z"},{"category":"sports","title":"Ashwin played his role to perfection against DC: Mohammad Kaif","content":"Former Indian cricketer Mohammad Kaif has praised RR's Ravichandran Ashwin for his performance against DC, stating that the all-rounder performed his role to perfection. \"It was not easy to bat because the ball was stopping on the pitch,\" added Kaif. Batting at the number three position, Ashwin scored 50 off 38 balls to help RR post 160\/6.\n\nshort by Ankur Taliyan \/ \n      02:34 pm on 12 May","author":"Ankur Taliyan","published":"2022-05-12T09:04:24.000Z"},{"category":"sports","title":"There is a big question mark on Kieron Pollard's form: Parthiv","content":"Ex-India player Parthiv Patel has said MI all-rounder Kieron Pollard's form is the only point of concern for MI ahead of their match against CSK on Thursday. \"There is a big question mark on Pollard's form and the way he is approaching the game,\" he added. So far, Pollard has scored 144 runs from his 11 games this season. \n\nshort by Ankur Taliyan \/ \n      11:26 am on 12 May","author":"Ankur Taliyan","published":"2022-05-12T05:56:31.000Z"},{"category":"sports","title":"Had a few practice games where I opened also: Ashwin on batting at no. 3","content":"RR all-rounder Ravichandran Ashwin, who has now batted thrice at the number three position in IPL 2022, has revealed that the management had \"communicated properly\" that they would be using him up the order at the start of the season. \"We had a few practice games where I opened  [also],\" he added. Ashwin scored 50(38) against DC on Wednesday. \n\nshort by Ankur Taliyan \/ \n      10:51 am on 12 May","author":"Ankur Taliyan","published":"2022-05-12T05:21:00.000Z"},{"category":"sports","title":"After injury, COVID, I felt I was batting with the wrong end of my bat: Marsh","content":"Speaking about how he struggled to find rhythm due to an injury and then testing positive for COVID-19 in IPL 2022, DC all-rounder Mitchell Marsh said, \"I felt I was batting with the wrong end of my bat.\" Marsh was named Man of the Match for his performance against RR on Wednesday. The 30-year-old picked two wickets and scored 89(62). \n\nshort by Ankur Taliyan \/ \n      12:19 pm on 12 May","author":"Ankur Taliyan","published":"2022-05-12T06:49:32.000Z"},{"category":"sports","title":"Take responsibility, bat at no. 3 or no. 4: Gavaskar on Sanju Samson","content":"Ex-India captain Sunil Gavaskar said RR captain Sanju Samson should take responsibility of batting at number three or number four, being a number four batter. Discussing Samson's six off four balls against DC, Gavaskar stated, \"Samson suddenly found that because RR hadn't got the [required] start, he got to start playing...shots from the word go. In that attempt, he perished.\"\n\nshort by Arnab Mukherji  \/ \n      03:33 pm on 12 May","author":"Arnab Mukherji ","published":"2022-05-12T10:03:14.000Z"},{"category":"sports","title":"Rishabh Pant has made simple mistakes with his shot selection: Watson","content":"DC assistant coach Shane Watson said the team's captain Rishabh Pant has made \"simple\" mistakes with his shot selection in IPL 2022 so far. \"Little things haven't gone Pant's way. A couple of random chop ons out of nowhere,\" added Watson. \"Pant's mindset is to entertain. He would prefer to go down taking the game on than...being defensive,\" stated Watson.\n\nshort by Arnab Mukherji  \/ \n      07:15 pm on 12 May","author":"Arnab Mukherji ","published":"2022-05-12T13:45:51.000Z"},{"category":"sports","title":"We will make it right next season: MI's Ishan Kishan","content":"With MI being at the bottom of the IPL 2022 points table, opener Ishan Kishan said they will \"make it right next season\". On his own performance, Ishan said, \"[Initially], my focus was on giving good starts to the team. But later on, somewhere I was trying to finish the games...maybe I lost my focus in first six overs.\"\n\nshort by Ankur Taliyan \/ \n      09:42 am on 12 May","author":"Ankur Taliyan","published":"2022-05-12T04:12:16.000Z"},{"category":"sports","title":"I want to steal Djokovic's elasticity, Nadal's self-sacrifice: Alcaraz","content":"Spain's Carlos Alcaraz said he wants to steal Novak Djokovic's elasticity and physique as well as Roger Federer's elegance. \"I would steal Rafael Nadal's fighting spirit, self-sacrifice, work ethic. If I have to train three hours, I train at 200 percent intensity,\" added Alcaraz. \"I want to continue climbing...If it can be to heaven, even better,\" stated Alcaraz.\n\nshort by Arnab Mukherji  \/ \n      05:26 pm on 12 May","author":"Arnab Mukherji ","published":"2022-05-12T11:56:27.000Z"},{"category":"sports","title":"He was set to sign a new Barca contract: PSG's Paredes on teammate Messi","content":"PSG midfielder Leo Paredes said his team's forward Lionel Messi was going to sign a new contract with Barcelona having arranged everything, before suddenly opting to join PSG instead. \"I don't know what happened on that trip to Barcelona because the same night he was going to sign the contract, Messi told us he was coming here,\" added Paredes.\n\nshort by Arnab Mukherji  \/ \n      04:20 pm on 12 May","author":"Arnab Mukherji ","published":"2022-05-12T10:50:52.000Z"},{"category":"sports","title":"Can't finish semi-final at 1 am, play final next day: Djokovic backs Zverev","content":"Reacting to Alexander Zverev criticising the ATP Tour for scheduling his Madrid Open final a day after his semi-final, Novak Djokovic said, \"You can't finish your semi-final match at 1 am and play the final...next day.\" \"I understand...they want to sell more tickets...but that can cause problems,\" added Djokovic. Zverev lost his Madrid Open final against Carlos Alcaraz.\n\nshort by Arnab Mukherji  \/ \n      02:48 pm on 12 May","author":"Arnab Mukherji ","published":"2022-05-12T09:18:54.000Z"},{"category":"entertainment","title":"Actress Chhavi Mittal shares pic showing her scar after breast cancer surgery","content":"Actress Chhavi Mittal took to Instagram to share a picture showing her scar, days after her breast cancer surgery. \"I did the unthinkable! I went to the gym today...I could do squats, lunges, Bulgarian split squats, calf raises, single-leg squats and sumo squats,\" she wrote. \"I even got to sport my scar on the armpit while at it,\" she added.\n\nshort by Pragya Swastik \/ \n      04:50 pm on 12 May","author":"Pragya Swastik","published":"2022-05-12T11:20:38.000Z"},{"category":"entertainment","title":"I've been raped multiple times because I was too drunk to say 'Stop': Actress Selma Blair","content":"Hollywood actress Selma Blair stated in her memoir that she has been raped multiple times while being drunk. \"I was too drunk to say the words 'Please. Stop',\" she wrote. \"I came out of each event quiet and ashamed,\" she added. She revealed she was once raped after a day of binge-drinking during a college spring break trip.\n\nshort by Anmol Sharma \/ \n      04:53 pm on 12 May","author":"Anmol Sharma","published":"2022-05-12T11:23:39.000Z"},{"category":"entertainment","title":"To each his own: Suniel Shetty on actors being questioned for endorsing tobacco products","content":"Talking about actors being questioned for endorsing tobacco products, Suniel Shetty said, \"To each his own...Alcohol and tobacco get sold...which is why they're advertised.\" He added, \"Those who don't want to consume it should refrain from doing so.\" Adding that he doesn't consume tobacco, Suniel said, \"That doesn't mean I'm a saint...I won't say I'm right and others are wrong.\"\n\nshort by Anmol Sharma \/ \n      12:46 pm on 12 May","author":"Anmol Sharma","published":"2022-05-12T07:16:18.000Z"},{"category":"entertainment","title":"Singer Adele shares pic of her new mansion said to be worth around ₹450 crore","content":"Singer Adele and boyfriend Rich Paul have shared a picture of them standing outside what is thought to be the couple's first home together. The mansion, said to be worth $58 million (around ₹450 crore) was previously owned by Sylvester Stallone and is located in the Beverly Hills area of Los Angeles. \"Time flies,\" wrote Adele while sharing the photo.\n\n\n\nshort by Daisy Mowke \/ \n      02:53 pm on 12 May","author":"Daisy Mowke","published":"2022-05-12T09:23:57.000Z"},{"category":"entertainment","title":"Salman offers condolences to brother-in-law Aayush on his grandfather's death","content":"Actor Salman Khan offered his condolences to his brother-in-law Aayush Sharma after his grandfather, former politician Pandit Sukh Ram Sharma's death. Sharing a photo of Aayush's grandfather on Instagram, Salman wrote, \"Sending my heartfelt condolences to Aayush...on the loss of his grandfather Shri Sukhram ji today.\" The former Union Minister reportedly suffered a brain stroke.\n\nshort by Mahima Kharbanda \/ \n      04:33 pm on 12 May","author":"Mahima Kharbanda","published":"2022-05-12T11:03:55.000Z"},{"category":"entertainment","title":"It does disappoint: Kiara Advani on role of actresses in comedy films","content":"Actress Kiara Advani, speaking about comedy films, has said, \"It's very rare that a female protagonist adds a punch.\" She added that the character arc of a male protagonist and a female protagonist cannot be compared. \"Unfortunately that's how (the script) is written...It definitely does disappoint,\" Kiara further said. The actress will next be seen in 'Bhool Bhulaiyaa 2'.\n\nshort by Amartya Sharma \/ \n      07:27 pm on 12 May","author":"Amartya Sharma","published":"2022-05-12T13:57:47.000Z"},{"category":"entertainment","title":"I don't ask him about projects I should work on: Nazia on uncle Sanjay Dutt","content":"Actress Nazia Hussain, who is the grand daughter of actor Sanjay Dutt's maternal uncle, said that she does ask the actor if she should be taking up and working on any particular projects. \"When you are related to someone who's such a big star, it's constantly like 'Am I going to be good enough',\" she added.\n\n\n\nshort by Ria Kapoor \/ \n      05:18 pm on 12 May","author":"Ria Kapoor","published":"2022-05-12T11:48:40.000Z"},{"category":"entertainment","title":"You don't work for it: Arjun on being generation's 1st actor to cross ₹100-cr mark","content":"On being asked about being first actor from his generation to have crossed ₹100-crore mark, actor Arjun Kapoor said, \"Yes I was the first (actor of my generation) to cross the ₹100-crore mark but that's not something you work for. You work for making films that continuously do well. The numbers evolve. Phases happen in an actor's life.\"\n\nshort by Ria Kapoor \/ \n      06:06 pm on 12 May","author":"Ria Kapoor","published":"2022-05-12T12:36:35.000Z"},{"category":"entertainment","title":"Tantrums, abuse weren't allowed in our house; kids could express: Priyanka's mom","content":"Priyanka Chopra's mother Madhu Chopra said that even though their household was liberal, there were certain limitations. \"Tantrums were never allowed, raised voices were never allowed, abuse was never allowed. With these things banned, they could express themselves,\" she added. She also said they used to discuss what happened in Priyanka and Siddharth's school and shared advice on it. \n\nshort by Ria Kapoor \/ \n      04:14 pm on 12 May","author":"Ria Kapoor","published":"2022-05-12T10:44:47.000Z"},{"category":"entertainment","title":"Can't force these things: Sharmila on working with daughter-in-law Kareena","content":"When asked about working with her daughter-in-law, actress Kareena Kapoor in future, veteran actress Sharmila Tagore said, \"It's best if it happens organically, rather than being forced.\" She added that the audience would like to see a well-made film at the end of the day. \"We're all a family of working actors and we all enjoy our work,\" Sharmila said.\n\nshort by Mahima Kharbanda \/ \n      02:00 pm on 12 May","author":"Mahima Kharbanda","published":"2022-05-12T08:30:57.000Z"},{"category":"entertainment","title":"Pic of Shah Rukh Khan, Rajkumar Hirani from 'Dunki' sets goes viral","content":"A picture of actor Shah Rukh Khan and filmmaker Rajkumar Hirani from the sets of 'Dunki' has gone viral on social media. In the picture, Shah Rukh can be seen wearing a grey t-shirt and dark jeans, along with sunglasses. Commenting on the pic, a Twitter user wrote, \"He's looking so fresh, same as 'Kabhi Khushi Kabhie Gham' Shahrukh.\"  \n\nshort by Amartya Sharma \/ \n      08:37 pm on 12 May","author":"Amartya Sharma","published":"2022-05-12T15:07:05.000Z"},{"category":"entertainment","title":"Laughter Champions to replace Kapil Sharma Show during US tour: Report","content":"'The Kapil Sharma Show' will reportedly be replaced by 'Laughter Champions' as comedian Kapil Sharma and his team will be on a US tour in June. The show will be judged by Archana Puran Singh and Shekhar Suman. A source told The Indian Express, \"With no stand-up comedy show at the moment, the team decided to launch one.\"\n\nshort by Amartya Sharma \/ \n      04:11 pm on 12 May","author":"Amartya Sharma","published":"2022-05-12T10:41:50.000Z"},{"category":"entertainment","title":"Got colonial characters in India due to white face: 'RRR' actor Edward","content":"American actor Edward Sonnenblick, who featured in 'RRR', has said, \"There was...niche for someone like me in the industry, white faces got colonial characters. That's the majority of roles that come my way.\" However, he added he does get to play other roles in films like 'Saving Chintu' where he played an American guy trying to adopt a kid.\n\nshort by Amartya Sharma \/ \n      07:23 pm on 12 May","author":"Amartya Sharma","published":"2022-05-12T13:53:04.000Z"},{"category":"entertainment","title":"It was a joke: Bella on rumours that she blacked out because of her corset","content":"In a recent Instagram story, Bella Hadid reacted to the rumours of her blacking out at the Met Gala because she couldn't breathe in her corset. \"I didn't say I blacked out because of my corset,\" she said. \"I joked that I blacked out, not because of my corset but from the...anxieties and excitement of the carpet,\" she added.\n\nshort by Mahima Kharbanda \/ \n      02:43 pm on 12 May","author":"Mahima Kharbanda","published":"2022-05-12T09:13:34.000Z"},{"category":"entertainment","title":"I'm mortified, have a lot of anxiety; won't watch 'Doctor Strange..': Elizabeth","content":"Actress Elizabeth Olsen, when asked about being leading lady in a blockbuster movie, said that she is mortified and has a lot of anxiety about 'Doctor Strange in the Multiverse of Madness'. She added she will not be watching the movie and that she is facing such pressure for the first time. \"I've never...had to lead...commercial film...by myself,\" she added.\n\nshort by Ria Kapoor \/ \n      05:44 pm on 12 May","author":"Ria Kapoor","published":"2022-05-12T12:14:57.000Z"},{"category":"entertainment","title":"Can't get married as rumours are spread that I beat up boys: Kangana","content":"Actress Kangana Ranaut, in an interview with RJ Siddharth Kannan, was asked if she is like her character in 'Dhaakad' in real life. To this, she replied, \"Who will I beat up in real life? I'm unable to get married because of people like you spreading these rumours.\" \"Rumours are spread about me that I beat up boys,\" she added.\n\nshort by Amartya Sharma \/ \n      06:14 pm on 12 May","author":"Amartya Sharma","published":"2022-05-12T12:44:03.000Z"},{"category":"entertainment","title":"My mami has every right to slap me: Krushna on Govinda's wife Sunita","content":"Speaking about his uncle Govinda and his wife Sunita, comedian-actor Krushna Abhishek said, \"My mama is my blood but I don't share the same blood with my mami. But she let us stay with them for 7-8 years.\" \"She loved me so much and that's why she has every right to scold me. She can slap me,\" he added.\n\nshort by Mahima Kharbanda \/ \n      03:31 pm on 12 May","author":"Mahima Kharbanda","published":"2022-05-12T10:01:56.000Z"},{"category":"entertainment","title":"Director had options but he backed his casting of Alia & me: Arjun on 2 States","content":"As Arjun Kapoor completed 10 years in Bollywood on May 11, he celebrated it by conducting an 'ask me anything' session on Instagram. During the session, one of his fans wrote, \"'2 States' is...one of my favourite films.\" In response, Arjun said, \"Our director Abhishek Verman...backed his casting of @aliabhatt and me when he had many options to choose from.\"\n\nshort by Mahima Kharbanda \/ \n      04:57 pm on 12 May","author":"Mahima Kharbanda","published":"2022-05-12T11:27:04.000Z"},{"category":"entertainment","title":"Been a 22-day rigorous struggle to get mom out of hospital: Urvashi Dholakia","content":"Actress Urvashi Dholakia shared the reason for her absence on social media and said she was taking care of her ailing mother. Taking to Instagram Story, Urvashi wrote, \"[It has] been a 22-day rigorous struggle to get mom out of the hospital but now she is back home. The struggle though isn't over as tremendous care has to be taken.\"\n\nshort by Mahima Kharbanda \/ \n      05:02 pm on 12 May","author":"Mahima Kharbanda","published":"2022-05-12T11:32:39.000Z"},{"category":"entertainment","title":"Can't do 'Koffee With Karan' but can do 'Tea with Twinkle', jokes Twinkle","content":"Actress-turned-writer Twinkle Khanna took to Instagram and shared a photo of herself with a cup and rollers on her hair. \"Can't do 'Koffee with Karan' again but 'Tea with Twinkle' may not be a bad idea after all,\" she captioned her post. Twinkle appeared on the show, hosted by Karan Johar, with her husband Akshay Kumar in season five. \n\nshort by Amartya Sharma \/ \n      06:36 pm on 12 May","author":"Amartya Sharma","published":"2022-05-12T13:06:15.000Z"},{"category":"entertainment","title":"Nobody cares for your story till you win: Sanjay Dutt on pic from gym","content":"Actor Sanjay Dutt took to social media to share a picture of himself from a workout session, with the caption, \"Nobody cares about your story till you win, so win!\" \"Baba you are always [a] winner, one will need 1000 guts to face what you have faced. You are...[an] inspiration to many,\" read a reaction on Twitter from a fan.\n\nshort by Arnab Mukherji  \/ \n      12:57 pm on 12 May","author":"Arnab Mukherji ","published":"2022-05-12T07:27:55.000Z"},{"category":"entertainment","title":"Felt that my kiss with Dharmendra was out of the box: Nafisa on Life In A Metro","content":"When asked about the pre-climax scene in film 'Life In A Metro', where Nafisa Ali and Dharmendra share a kiss, the veteran actress replied, \"When you are an actor, you have to portray whatever is required from your character. I felt...(the kiss) was out of the box and provided shock value.\" \"Two old people don't...kiss in Hindi movies,\" she said.\n\nshort by Mahima Kharbanda \/ \n      04:52 pm on 12 May","author":"Mahima Kharbanda","published":"2022-05-12T11:22:52.000Z"},{"category":"entertainment","title":"Didn't understand what Mahesh meant by B'wood can't afford him: RGV","content":"Reacting to actor Mahesh Babu's 'Bollywood can't afford me' remark, filmmaker Ram Gopal Varma said, \"I honestly didn't understand what he meant by Bollywood can't afford him.\" \"Bollywood isn't a company. It's a label given by...media. An individual movie company...will ask you to do a film at a particular cost...how can he generalise Bollywood, I don't understand that,\" he added.\n\nshort by Amartya Sharma \/ \n      02:58 pm on 12 May","author":"Amartya Sharma","published":"2022-05-12T09:28:20.000Z"},{"category":"entertainment","title":"He may have his reasons: Boney on Mahesh Babu's 'B'wood can't afford me' remark","content":"During a recent media interaction, Telugu actor Mahesh Babu reportedly said that \"Bollywood cannot afford\" him. Reacting to the same, producer Boney Kapoor said, \"I can't comment on this because I belong to both sides, Bollywood and South.\" \"Also, Mahesh has the right to say whatever he feels...He may have his own reasons for saying this,\" Boney added.\n\nshort by Mahima Kharbanda \/ \n      03:15 pm on 12 May","author":"Mahima Kharbanda","published":"2022-05-12T09:45:57.000Z"},{"category":"entertainment","title":"Taapsee Pannu-starrer 'Dobaaraa' to release on August 19","content":"Actress Taapsee Pannu's film 'Dobaaraa' will release on August 19 in theatres. The film, which is directed by Anurag Kashyap, was announced in 2021. Actor Pavail Gulati, who shared the screen with Taapsee in Anubhav Sinha's 'Thappad', also features in the film. This is Anurag and Taapsee's third collaboration after 'Manmarziyaan' and 'Saand Ki Aankh'.\n\nshort by Amartya Sharma \/ \n      08:33 pm on 12 May","author":"Amartya Sharma","published":"2022-05-12T15:03:26.000Z"},{"category":"technology","title":"Saudi Aramco dethrones Apple as world's most valuable company","content":"World's biggest crude exporter Saudi Aramco has overtaken Apple as the world's most valuable company. The Saudi state-run oil company's market cap rose to $2.43 trillion on Wednesday after its shares surged due to higher oil prices. Meanwhile, Apple's market capitalisation fell to $2.37 trillion after its share price tanked 5.2% on Wednesday.\n\nshort by Anmol Sharma \/ \n      11:10 am on 12 May","author":"Anmol Sharma","published":"2022-05-12T05:40:33.000Z"},{"category":"technology","title":"Stablecoin UST, that's meant to maintain a $1 peg, crashes to 40 cents","content":"TerraUSD or 'UST', a stablecoin that's meant to maintain a $1 peg, plunged over 55% on Wednesday from 24 hours earlier to around 40 cents. Its sister token fell more than 80% to $5 and other cryptocurrencies like Bitcoin and Ether also plunged. A stablecoin is a digital currency pegged to a \"stable\" reserve asset like the US dollar.\n\nshort by Pragya Swastik \/ \n      02:29 pm on 11 May","author":"Pragya Swastik","published":"2022-05-11T08:59:37.000Z"},{"category":"technology","title":"Disabled UPI payments because of informal pressure from RBI: Coinbase CEO","content":"Coinbase CEO Brian Armstrong has said that the cryptocurrency exchange suspended its UPI payment method due to informal pressure from Reserve Bank of India (RBI). \"India's Supreme Court has ruled that they can't ban crypto, but there are elements in the government there, including RBI, who don't seem to be as positive on it,\" he further said.\n\nshort by Ankush Verma \/ \n      12:52 pm on 11 May","author":"Ankush Verma","published":"2022-05-11T07:22:13.000Z"},{"category":"technology","title":"Over $200 billion wiped off cryptocurrency market in 24 hours","content":"More than $200 billion of wealth was wiped out from the cryptocurrency market in just 24 hours amid a massive sell-off, Bloomberg reported on Thursday citing CoinMarketCap data. The crypto plunge was driven by the collapse of the TerraUSD stablecoin. The plunge affected major tokens and Bitcoin plunged by as much as 10% to its lowest level since December 2020.\n\nshort by Pragya Swastik \/ \n      05:49 pm on 12 May","author":"Pragya Swastik","published":"2022-05-12T12:19:46.000Z"},{"category":"technology","title":"Ukraine commander asks Musk for help, tweets 'People say you come from another planet'","content":"The commander of a Ukrainian Marine Brigade has appealed to Elon Musk to help soldiers escape a steel plant besieged by Russian forces in Mariupol. Major Serhiy Volyna tweeted, \"Elon Musk, people say you come from another planet to teach people to believe in the impossible...Help us get out of Azovstal...If not you, then who? Give me a hint.\"\n\nshort by Apaar Sharma \/ \n      09:48 am on 12 May","author":"Apaar Sharma","published":"2022-05-12T04:18:34.000Z"},{"category":"technology","title":"Google teases smart glasses prototype that translates languages in real time","content":"Google CEO Sundar Pichai on Wednesday teased a pair of smart glasses capable of translating languages in real time during Google's I\/O developer summit. The company claimed that someone with the augmented reality glasses might be able to understand what another person is saying just by reading captions that are presented through the lenses while the other person speaks.\n\nshort by Ankush Verma \/ \n      09:41 am on 12 May","author":"Ankush Verma","published":"2022-05-12T04:11:13.000Z"},{"category":"technology","title":"Siemens announces exit from Russian market, condemns Ukrainian war","content":"German multinational conglomerate Siemens will quit the Russian market due to the war in Ukraine. \"We join the international community in condemning the war in Ukraine and are focused on supporting our people and providing humanitarian aid,\" CEO Roland Busch said. Siemens reportedly employs around 3,000 people in Russia and had earlier decided not to take on new projects there.\n\nshort by Aishwarya Awasthi \/ \n      11:22 am on 12 May","author":"Aishwarya Awasthi","published":"2022-05-12T05:52:27.000Z"},{"category":"technology","title":"I'll never be Twitter CEO again: Co-founder Jack Dorsey","content":"Twitter Co-founder and former CEO Jack Dorsey, in response to a tweet saying Elon Musk will eventually ask him to be the CEO, said, \"Nah I'll never be CEO again.\" On being asked if he would like such a prospect, Dorsey said, \"Nah. It's time to roll the dice again.\" He also said no one should be Twitter's CEO ultimately.\n\nshort by Aishwarya Awasthi \/ \n      10:02 am on 12 May","author":"Aishwarya Awasthi","published":"2022-05-12T04:32:01.000Z"},{"category":"technology","title":"Health, digital adoption among '5 megatrends' for the future: Tata Sons Chairman","content":"Tata Sons Chairman N Chandrasekaran has listed 'Digital adoption', 'Supply chain rebalance', 'Sustainability', 'Health' and 'Global talent pool' as the \"five megatrends\" for the future. He said these will have a \"big impact\" on economies, countries and businesses globally.  \"All businesses will have to become AI and data businesses...No industry can escape this trend,\" he said on digital adoption.\n\nshort by Pragya Swastik \/ \n      08:52 pm on 11 May","author":"Pragya Swastik","published":"2022-05-11T15:22:51.000Z"},{"category":"technology","title":"Apple's top engineer quits due to company's return to office policy: Report","content":"Ian Goodfellow, Apple's Director of Machine Learning, is reportedly leaving the company over its return to office policy. According to The Verge reporter Zoë Schiffer, Goodfellow told the company's staff, \"I believe strongly that more flexibility would have been the best policy for my team.\" Starting May 23, Apple reportedly requires employees in the office three days a week.\n\nshort by Pragya Swastik \/ \n      09:42 pm on 11 May","author":"Pragya Swastik","published":"2022-05-11T16:12:47.000Z"},{"category":"technology","title":"Google Translate adds support for 24 new languages including 8 Indian languages","content":"Google Translate is adding support for 24 new languages including eight new Indian language, the internet giant announced at its annual developer conference Google I\/O 2022. Assamese, Bhojpuri, Sanskrit, Dogri, Konkani, Maithili, Meiteilon (Manipuri), and Mizo are among the added languages. Google said it is also adding indigenous languages of the Americas such as Quechua, Guarani and Aymara.\n\nshort by Ankush Verma \/ \n      08:51 am on 12 May","author":"Ankush Verma","published":"2022-05-12T03:21:51.000Z"},{"category":"technology","title":"Chronological tweets are better than what algorithm suggests: Musk","content":"Tesla CEO Elon Musk took to Twitter to say, \"Chronological tweets seem much better than what 'the algorithm' suggests.\" He also asked users to tap on stars present in the upper right corner of their home page to revert to chronological order. Responding to Musk, Twitter Co-founder Jack Dorsey said, \"This is the way...Having [a] choice is the most important.\"\n\nshort by Aishwarya Awasthi \/ \n      11:06 am on 12 May","author":"Aishwarya Awasthi","published":"2022-05-12T05:36:56.000Z"},{"category":"technology","title":"Elon Musk's tweets on taking Tesla private were reckless: US judge","content":"A US judge said in an April judgement that Tesla CEO Elon Musk's 2018 tweets on taking Tesla private were inaccurate and reckless, adding \"there was nothing concrete\" about financing from Saudi Arabia's PIF. \"Rather, discussions between Tesla and the PIF were clearly at the preliminary stage,\" the judge added. Musk has insisted that tweets were entirely truthful.\n\nshort by Aishwarya Awasthi \/ \n      12:51 pm on 11 May","author":"Aishwarya Awasthi","published":"2022-05-11T07:21:55.000Z"},{"category":"technology","title":"Apple testing folding panel for iPhone and iPad: Report","content":"Apple is developing a new folding OLED screen that would eventually be used in a folding iPhone or iPad, South Korea's TheElec reported. Apple is reportedly developing a polarizer-less OLED screen, the same technology which is used by Samsung in its Galaxy Z Fold3 and its Eco2OLED display. Currently, polarizer is being used in some conventional folding displays.\n\nshort by Ananya Goyal \/ \n      05:43 pm on 11 May","author":"Ananya Goyal","published":"2022-05-11T12:13:28.000Z"},{"category":"technology","title":"Apple may drop iPhone Lightning port for USB-C in 2023: Report","content":"Apple is planning to switch from the Lightning port on its iPhones to USB-C port in 2023, analyst Ming-Chi Kuo reported. He said that adopting USB-C \"could improve iPhone's transfer and charging speed in hardware designs, but the final specification details still depend on iOS support.\" The EU had earlier proposed mandatory USB-C port on all devices, including iPhones.\n\nshort by Aishwarya Awasthi \/ \n      03:49 pm on 12 May","author":"Aishwarya Awasthi","published":"2022-05-12T10:19:44.000Z"},{"category":"technology","title":"Chinese burn 3 am oil, Americans avoid going to work at all: Musk","content":"The world's richest person Elon Musk praised Chinese workers in a recent interview. He said, \"[Chinese] won't just be burning the midnight oil...they'll be burning the 3 am oil...whereas, in America, people are trying to avoid going to work at all.\" Musk added that most of Tesla's competition would come from China while adding, \"There are...supertalented hardworking people in China.\" \n\nshort by Ananya Goyal \/ \n      06:59 pm on 11 May","author":"Ananya Goyal","published":"2022-05-11T13:29:14.000Z"},{"category":"technology","title":"Global crypto regulation body likely in next year: IOSCO Chair","content":"The International Organisation of Securities Commissions' (IOSCO) Chair Ashley Alder said global market regulators are likely to launch a joint body within the next year to better co-ordinate cryptocurrency rules. \"There's a wall of worry about this (crypto)...at an institutional level,\" Alder stated. He added that the main concerns are cyber security and a lack of transparency, among others.\n\nshort by Ananya Goyal \/ \n      08:10 pm on 12 May","author":"Ananya Goyal","published":"2022-05-12T14:40:54.000Z"},{"category":"technology","title":"Google to pay over 300 news publishers in EU, more to follow","content":"Google has agreed to pay over 300 publishers across the EU for their news and will roll out a tool for others to sign up too. However, Google has not revealed how much publishers will be paid. The EU had earlier adopted the copyright rules that require Google and other online platforms to pay news publishers for using their work.\n\n\nshort by Aishwarya Awasthi \/ \n      01:20 pm on 11 May","author":"Aishwarya Awasthi","published":"2022-05-11T07:50:01.000Z"},{"category":"technology","title":"Meta tells Reality Labs staff it's planning cutbacks in the divison","content":"Meta has told its Reality Labs employees that it's planning cutbacks in the division. Chief Technology Officer Andrew Bosworth informed Reality Labs staffers to expect certain changes and that the division could not afford to do some projects anymore and would have to postpone others. A Meta spokesperson said the firm was not planning layoffs as part of the changes.\n\n\nshort by Aishwarya Awasthi \/ \n      01:55 pm on 12 May","author":"Aishwarya Awasthi","published":"2022-05-12T08:25:13.000Z"},{"category":"technology","title":"Musk's delay in disclosing Twitter stake under probe by US SEC: WSJ","content":"The US SEC is investigating Tesla CEO Elon Musk's delay in disclosing his Twitter stake last month, the WSJ reported. Musk had revealed his 9.2% stake in Twitter to SEC on April 4, a delay of at least 10 days since surpassing the 5% threshold for revealing a shareholding. Musk has lately been embroiled in a dispute with the SEC.\n\nshort by Aishwarya Awasthi \/ \n      09:11 am on 12 May","author":"Aishwarya Awasthi","published":"2022-05-12T03:41:36.000Z"},{"category":"technology","title":"Musk says Tesla is open to buying a mining firm in push for clean energy","content":"Tesla CEO Elon Musk has said that Tesla is open to buying a mining company in a push for the worldwide adoption of clean energy technologies. \"It's not out of the question. We will address whatever limitations are on accelerating the world's transition to sustainable energy. It's not that we wish to buy mining companies,\" he added.\n\n\n\nshort by Aishwarya Awasthi \/ \n      02:52 pm on 11 May","author":"Aishwarya Awasthi","published":"2022-05-11T09:22:22.000Z"},{"category":"technology","title":"HC allows Xiaomi conditional access to seized ₹5,551 cr: Report","content":"The Karnataka High Court has declined to reinstate a freeze on ₹5,551 crore belonging to Chinese smartphone-maker Xiaomi, Hindustan Times reported citing Reuters. The funds were seized by the Enforcement Directorate in connection with \"illegal outward remittances\" but the seizure was stayed after Xiaomi appealed. The Court also allowed Xiaomi to use a bank overdraft facility to make payments.\n\nshort by Ashley Paul \/ \n      03:49 pm on 12 May","author":"Ashley Paul","published":"2022-05-12T10:19:05.000Z"},{"category":"technology","title":"24x7 digital payments helpline 'DigiSaathi' now on WhatsApp: NPCI","content":"The government's 24x7 helpline 'DigiSaathi' that provides information on digital payment products and services is now available on WhatsApp, the National Payments Commission of India (NPCI) said. Users can access the helpline by texting +91-892-891-3333 via WhatsApp. It answers queries on cards, UPI, NEFT, RTGS, Wallets, ATM, QR (UPI\/Bharat), mobile and net banking, among others.\n\nshort by Ananya Goyal \/ \n      03:57 pm on 11 May","author":"Ananya Goyal","published":"2022-05-11T10:27:12.000Z"},{"category":"technology","title":"Google unveils new 10-shade skin tone scale to address bias in products","content":"Google unveiled a new 10-shade skin tone palette at its I\/O developer conference that it's incorporating into several of its products over the coming months. The Monk Skin Tone Scale is designed to replace outdated skin tone scales that are biased towards lighter skin. Beauty-related Google Images searches such as 'bridal makeup looks' now allow filtering results based on Monk. \n\nshort by Aishwarya Awasthi \/ \n      09:51 am on 12 May","author":"Aishwarya Awasthi","published":"2022-05-12T04:21:09.000Z"},{"category":"technology","title":"Meta tells hardware staffers to prepare for cutbacks: Report","content":"Meta is preparing cutbacks in its Reality Labs division, a unit which is part of the company's strategy to refocus on hardware products and the metaverse, Reuters reported citing a spokesperson. Meta Chief Technology Officer Andrew Bosworth on Tuesday said the changes are expected within a week. Meta isn't planning layoffs as part of the changes, the spokesperson added.\n\nshort by Ashley Paul \/ \n      07:46 pm on 12 May","author":"Ashley Paul","published":"2022-05-12T14:16:34.000Z"}]